---
kind: other
id: Properties.T:Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs
source: html/d137c2b2-72bb-d99a-f41d-d128c46f80f7.htm
---
# MessageBoxShowingEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.